p = print #совершенно не обязательно делать
x = float(input())
y = float(input())
p(f'Вы ввели числа: {x=} {y=}'); a, b, c, d, e = x + y, x - y, x * y, x / y, x // y #a...e присвоены для наглядности
p('Математические операции: x + y, x - y, x * y, x / y, x // y')
p(f'Результат: {a=} {b=} {c=} {d=} {e=} ')
list_ = [a, b, c, d, e] #преобразуем в список
list_.sort() #упорядочим по возрастанию
p(f'Упорядоченный массив: {list_}')
p(f'Максимальное число в массиве: {max (list_)}')
p(f'Cледующее число, после максимума: {list_[-2]}')

