число: int = input() #вводим число в строку
x = [int(i) for i in str(число)] #преобразуем в int

балл = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
stat = [0] * 10 #создали образ числа, зарезервировали массив
for k in range(len(x)): #прошлись по списку, подсчитали количество повторений числа
    x[k] = int(x[k])
for grade in x:
    stat[grade] += 1

for i in range(10): #выводим статистику в требуемом формате
    if stat[i] != 0: #через дефис или двоеточие
        print(f'{балл[i]} : {stat[i]}')